app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%x%')
SELECT "products".* FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      if Rails.env.development?
      @products = Product.where("name LIKE ?", "%#{search_term}%")
      else
      @products = Product.where("name ilike ?", "%#{search_term}%")
      end
    else
      @products = Product.all

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bike1"], ["description", "Description1"], ["image_url", "/app/assets/images/bike.jpg"], ["created_at", "2017-09-06 10:45:42.323062"], ["updated_at", "2017-09-06 10:45:42.323062"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Best bike in store"], ["updated_at", "2017-09-07 12:29:31.594221"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)