app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Romli"], ["last_name", "Bisumann"], ["updated_at", "2017-09-10 06:59:05.227631"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)